const products = [
    {
        id: 1,
        name: '兩儀墜',
        desc:'太極生兩儀，兩儀為陰陽。身上帶有兩儀墜能夠有調和身體陰陽的神奇功效。',
        price: 125,
        stock: 5
    },
    {
        id: 2,
        name: '青銅劍',
        desc:'用青銅鑄成的一把長劍，劍刃厚長，但拿在手上重量較輕，非常稱手。',
        price: 250,
        stock: 3
    },
    {
        id: 3,
        name: '降魔珠',
        desc:'這是一條降魔佛串，共有十八粒佛珠，每顆佛珠上都雕有一位羅漢金身像。',
        price: 575,
        stock: 3
    },
    {
        id: 4,
        name: '幽玉戒',
        desc:'鑲嵌著黝黑珠玉的骨製戒指，戒指上的黝黑珠玉奇妙異常，雖說其上黯淡無光，但凝神望去卻又能在其中看出七彩斑斕之色。',
        price: 1000,
        stock: 1
    },
    {
        id: 5,
        name: '七星碎岳枪',
        desc:'这柄长枪這柄長槍為槍王王白石的成名兵刃，槍身湛藍，其中混有天外隕鐵，使得槍身有點點斑駁，宛若星辰。槍頭寒芒凌冽，鋒銳無比。',
        price: 9925,
        stock: 1
    },
]